error.general=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u0430 \u043D\u0435\u043F\u0440\u0435\u0434\u0432\u0438\u0434\u0435\u043D\u043D\u0430\u044F \u043E\u0448\u0438\u0431\u043A\u0430. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u043F\u043E\u0437\u0436\u0435 \u0438\u043B\u0438 \u0441\u0432\u044F\u0436\u0438\u0442\u0435\u0441\u044C \u0441\u043E \u0441\u043B\u0443\u0436\u0431\u043E\u0439 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0438, \u0435\u0441\u043B\u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u0435\u0442\u0441\u044F.
error.database.uniqueConstraintViolation=\u041E\u0448\u0438\u0431\u043A\u0430: \u041D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0438\u0437 \u0432\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0445 \u0432\u0430\u043C\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0442 \u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u0435, \u0438 \u0441\u0438\u0441\u0442\u0435\u043C\u0430 \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442 \u0434\u0443\u0431\u043B\u0438\u043A\u0430\u0442\u043E\u0432. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0443\u043A\u0430\u0436\u0438\u0442\u0435 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435.
error.database.genericIntegrityViolation=\u041E\u0448\u0438\u0431\u043A\u0430: \u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E \u043D\u0430\u0440\u0443\u0448\u0435\u043D\u0438\u0435 \u0446\u0435\u043B\u043E\u0441\u0442\u043D\u043E\u0441\u0442\u0438 \u0434\u0430\u043D\u043D\u044B\u0445. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043F\u0440\u043E\u0432\u0435\u0440\u044C\u0442\u0435 \u0432\u0430\u0448\u0438 \u0434\u0430\u043D\u043D\u044B\u0435 \u0438 \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0441\u043D\u043E\u0432\u0430.
error.database.foreignKeyConstraintViolation=\u041E\u0448\u0438\u0431\u043A\u0430: \u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0443\u0434\u0430\u043B\u0438\u0442\u044C \u044D\u043B\u0435\u043C\u0435\u043D\u0442, \u0442\u0430\u043A \u043A\u0430\u043A \u043E\u043D \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0432 \u0434\u0440\u0443\u0433\u0438\u0445 \u0447\u0430\u0441\u0442\u044F\u0445 \u0441\u0438\u0441\u0442\u0435\u043C\u044B. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u0435 \u0438\u043B\u0438 \u0443\u0434\u0430\u043B\u0438\u0442\u0435 \u0441\u0432\u044F\u0437\u0430\u043D\u043D\u044B\u0435 \u0437\u0430\u043F\u0438\u0441\u0438, \u0430 \u0437\u0430\u0442\u0435\u043C \u043F\u043E\u0432\u0442\u043E\u0440\u0438\u0442\u0435 \u043F\u043E\u043F\u044B\u0442\u043A\u0443.

error.currency.creation=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043D\u043E\u0432\u044B\u0439 \u0441\u0442\u0430\u0442\u0443\u0441 \u0432\u0430\u043B\u044E\u0442\u044B.
error.payment.update=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C: \u042D\u0442\u043E\u0442 \u043F\u043B\u0430\u0442\u0435\u0436 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0438\u0437\u043C\u0435\u043D\u0435\u043D, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0443 \u043D\u0435\u0433\u043E \u0435\u0441\u0442\u044C \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435 \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0443\u0434\u0430\u043B\u0438\u0442\u0435 \u0435\u0433\u043E \u0438\u0437 \u0432\u0441\u0435\u0445 \u0441\u0447\u0435\u0442\u043E\u0432 \u043F\u0435\u0440\u0435\u0434 \u0432\u043D\u0435\u0441\u0435\u043D\u0438\u0435\u043C \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0439.
error.invoice.update=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C: \u042D\u0442\u043E\u0442 \u0441\u0447\u0435\u0442 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0438\u0437\u043C\u0435\u043D\u0435\u043D, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0443 \u043D\u0435\u0433\u043E \u0435\u0441\u0442\u044C \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435 \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0443\u0434\u0430\u043B\u0438\u0442\u0435 \u0435\u0433\u043E \u0438\u0437 \u0432\u0441\u0435\u0445 \u043F\u043B\u0430\u0442\u0435\u0436\u0435\u0439 \u043F\u0435\u0440\u0435\u0434 \u0432\u043D\u0435\u0441\u0435\u043D\u0438\u0435\u043C \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0439.
error.serviceType.creation=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043D\u043E\u0432\u044B\u0439 \u0441\u0442\u0430\u0442\u0443\u0441 \u0432\u0430\u043B\u044E\u0442\u044B.
error.exchangeRate.retrievalFailed=\u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u043E\u0431\u043C\u0435\u043D\u043D\u044B\u0439 \u043A\u0443\u0440\u0441 \u0434\u043B\u044F \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u044B\u0445 ID \u0432\u0430\u043B\u044E\u0442 \u0438\u0437 {0} \u0432 {1} \u043D\u0430 \u0434\u0430\u0442\u0443 {2}. \u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043F\u0440\u043E\u0432\u0435\u0440\u044C\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u0438 \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0441\u043D\u043E\u0432\u0430.

error.paymentInvoice.allocationNotFound=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0433\u043E ID: {0}.
error.paymentInvoice.allocatedAmountExceedsUnallocated=\u0414\u043E\u0441\u0442\u0443\u043F\u043D\u0430\u044F \u043A \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044E \u0441\u0443\u043C\u043C\u0430 \u0432 \u044D\u0442\u043E\u043C \u043F\u043B\u0430\u0442\u0435\u0436\u0435 \u043C\u0435\u043D\u044C\u0448\u0435, \u0447\u0435\u043C \u0432\u044B \u043F\u044B\u0442\u0430\u0435\u0442\u0435\u0441\u044C \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0438\u0442\u044C.
error.paymentInvoice.convertedAmountExceedsOutstandingBalance=\u041A\u043E\u043D\u0432\u0435\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0441\u0443\u043C\u043C\u0430 \u043F\u0440\u0435\u0432\u044B\u0448\u0430\u0435\u0442 \u043D\u0435\u043F\u043E\u0433\u0430\u0448\u0435\u043D\u043D\u044B\u0439 \u043E\u0441\u0442\u0430\u0442\u043E\u043A \u043F\u043E \u0441\u0447\u0435\u0442\u0443.
error.paymentInvoice.validExchangeRateRequired=\u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0439 \u043E\u0431\u043C\u0435\u043D\u043D\u044B\u0439 \u043A\u0443\u0440\u0441.
error.paymentInvoice.exchangeRateShouldBeOne=\u041E\u0431\u043C\u0435\u043D\u043D\u044B\u0439 \u043A\u0443\u0440\u0441 \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u0440\u0430\u0432\u0435\u043D 1, \u043A\u043E\u0433\u0434\u0430 \u0432\u0430\u043B\u044E\u0442\u044B \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u044E\u0442.
error.paymentInvoice.amountsMustBeEqualForSameCurrency=\u0420\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u0430\u044F \u0441\u0443\u043C\u043C\u0430 \u0438 \u043A\u043E\u043D\u0432\u0435\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0441\u0443\u043C\u043C\u0430 \u0434\u043E\u043B\u0436\u043D\u044B \u0431\u044B\u0442\u044C \u0440\u0430\u0432\u043D\u044B, \u043A\u043E\u0433\u0434\u0430 \u0432\u0430\u043B\u044E\u0442\u044B \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u044E\u0442.

error.invoice.notFound=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D \u0438\u043D\u0432\u043E\u0439\u0441 \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0433\u043E ID: {0}.
error.payment.notFound=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D \u043F\u043B\u0430\u0442\u0435\u0436 \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0433\u043E ID: {0}.

error.client.notFound=\u041A\u043B\u0438\u0435\u043D\u0442 \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C ID: {0}.
error.paymentInvoice.client.notFound=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0433\u043E \u043A\u043B\u0438\u0435\u043D\u0442\u0430 \u0441 \u043D\u043E\u043C\u0435\u0440\u043E\u043C ID: {0}.
error.paymentInvoice.payment.notFound=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0433\u043E \u043F\u043B\u0430\u0442\u0435\u0436\u0430 \u0441 \u043D\u043E\u043C\u0435\u0440\u043E\u043C ID: {0}.
error.paymentInvoice.invoice.notFound=\u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u0434\u043B\u044F \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0433\u043E \u0438\u043D\u0432\u043E\u0439\u0441\u0430 \u0441 \u043D\u043E\u043C\u0435\u0440\u043E\u043C ID: {0}.

validation.paymentInvoice.paymentId.required=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F ID \u043F\u043B\u0430\u0442\u0435\u0436\u0430.
validation.paymentInvoice.invoiceId.required=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F ID \u0441\u0447\u0435\u0442\u0430.
validation.paymentInvoice.allocatedAmount.required=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u0441\u0443\u043C\u043C\u0430 \u0434\u043B\u044F \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F.
validation.paymentInvoice.allocatedAmount.min=\u0421\u0443\u043C\u043C\u0430 \u0434\u043B\u044F \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 0.01.
validation.paymentInvoice.allocatedAmount.format=\u0421\u0443\u043C\u043C\u0430 \u0434\u043B\u044F \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u044B\u043C \u0447\u0438\u0441\u043B\u043E\u043C \u0441 \u043C\u0430\u043A\u0441\u0438\u043C\u0443\u043C 10 \u0446\u0438\u0444\u0440\u0430\u043C\u0438 \u0438 2 \u0434\u0435\u0441\u044F\u0442\u0438\u0447\u043D\u044B\u043C\u0438 \u0437\u043D\u0430\u043A\u0430\u043C\u0438.
validation.paymentInvoice.convertedAmount.min=\u0421\u0443\u043C\u043C\u0430 \u043F\u043E\u0441\u043B\u0435 \u043A\u043E\u043D\u0432\u0435\u0440\u0442\u0430\u0446\u0438\u0438 \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 0.01.
validation.paymentInvoice.convertedAmount.format=\u0421\u0443\u043C\u043C\u0430 \u043F\u043E\u0441\u043B\u0435 \u043A\u043E\u043D\u0432\u0435\u0440\u0442\u0430\u0446\u0438\u0438 \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u044B\u043C \u0447\u0438\u0441\u043B\u043E\u043C \u0441 \u043C\u0430\u043A\u0441\u0438\u043C\u0443\u043C 10 \u0446\u0438\u0444\u0440\u0430\u043C\u0438 \u0438 2 \u0434\u0435\u0441\u044F\u0442\u0438\u0447\u043D\u044B\u043C\u0438 \u0437\u043D\u0430\u043A\u0430\u043C\u0438.
validation.paymentInvoice.currencyFromId.required=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F ID \u0438\u0441\u0445\u043E\u0434\u043D\u043E\u0439 \u0432\u0430\u043B\u044E\u0442\u044B.
validation.paymentInvoice.currencyToId.required=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F ID \u0446\u0435\u043B\u0435\u0432\u043E\u0439 \u0432\u0430\u043B\u044E\u0442\u044B.
validation.paymentInvoice.exchangeRate.min=\u041A\u0443\u0440\u0441 \u043E\u0431\u043C\u0435\u043D\u0430 \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 0.000001.
validation.paymentInvoice.exchangeRate.format=\u041A\u0443\u0440\u0441 \u043E\u0431\u043C\u0435\u043D\u0430 \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u044B\u043C \u0447\u0438\u0441\u043B\u043E\u043C \u0441 \u043C\u0430\u043A\u0441\u0438\u043C\u0443\u043C 10 \u0446\u0438\u0444\u0440\u0430\u043C\u0438 \u0438 6 \u0434\u0435\u0441\u044F\u0442\u0438\u0447\u043D\u044B\u043C\u0438 \u0437\u043D\u0430\u043A\u0430\u043C\u0438.
error.paymentInvoice.paymentAndInvoiceClientMismatch=\u041F\u043B\u0430\u0442\u0435\u0436 \u0438 \u0441\u0447\u0435\u0442-\u0444\u0430\u043A\u0442\u0443\u0440\u0430 \u043F\u0440\u0438\u043D\u0430\u0434\u043B\u0435\u0436\u0430\u0442 \u0440\u0430\u0437\u043D\u044B\u043C \u043A\u043B\u0438\u0435\u043D\u0442\u0430\u043C. \u0420\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435 \u043D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E.

validation.payment.paymentDate.pastOrPresent=\u0423\u043A\u0430\u0436\u0438\u0442\u0435 \u0434\u0430\u0442\u0443 \u0438\u0437 \u043F\u0440\u043E\u0448\u043B\u043E\u0433\u043E \u0438\u043B\u0438 \u0441\u0435\u0433\u043E\u0434\u043D\u044F\u0448\u043D\u044E\u044E. \u0411\u0443\u0434\u0443\u0449\u0438\u0435 \u0434\u0430\u0442\u044B \u043D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B.

validation.currency.okv_code.pattern=\u041E\u041A\u0412 \u043A\u043E\u0434 \u0434\u043E\u043B\u0436\u0435\u043D \u0441\u043E\u0441\u0442\u043E\u044F\u0442\u044C \u0441\u0442\u0440\u043E\u0433\u043E \u0438\u0437 \u0442\u0440\u0435\u0445 \u0446\u0438\u0444\u0440, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, 123.

